izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/display_thread.cpp
#include "display_thread.h"
#include "m202md28a.h"
#include "preferences.h"
#include <stdio.h>
#include <time.h>

#define LINE1_START_X 2
#define LINE1_LEN 18

#define LINE2_START_X 0
#define LINE2_LEN 20

#define STATEICON_X 0
#define STATEICON_Y 0
#define STATEICON_FILL 2
#define STATEICON_STOP "\x80"
#define STATEICON_PLAY "\x81"
#define STATEICON_PAUSE "\x82"
#define STATEICON_LOAD "\x83"

#define VOLUME_START_X 0
#define VOLUME_START_Y 1
#define VOLUME_LEN 20
#define VOLUME_LINE_SIZE VOLUME_LEN

#define SCROLL_DEFAULT_SPEED 300
#define SCROLL_LINE1_SIZE LINE1_LEN

#define FFT_SIZE 1024 /* 对于双声道，每声道占用一半，对于单声道也是占用一半，但是两声道数据相同 */

/*
    https://github.com/reupen/columns_ui/blob/master/foo_ui_columns/vis_spectrum.cpp
*/
t_size g_scale_value_single(double val, t_size count, bool b_log)
{
    double val_trans;
    if (b_log) {
        constexpr auto minimum_value = -4;
        double log_val = val > 0 ? log10(val) : minimum_value;
        if (log_val < minimum_value)
            log_val = minimum_value;
        val_trans = count * (log_val + -minimum_value) / -minimum_value;
    }
    else {
        double start = (double)count * val;
        val_trans = start;
    }
    t_size ret = pfc::rint32(val_trans);
    ret = max(min(ret, count), 0);
    return ret;
}

DWORD WINAPI main_display_thread(LPVOID lpParamter)
{
    uint32_t i, j;

    hid_device* hid;
    DisplayThreadData* thread_data;
    PlayInfo* play_info;

    char line1_str[sizeof(play_info->str_line_1)];
    char line2_str[sizeof(play_info->str_line_2)];
    bool update_line1;
    bool update_line2;

    clock_t start_clock;
    uint16_t code_exec_time;

    char scroll_str[(SCROLL_LINE1_SIZE + 1) * 3];
    uint16_t scroll_delay_count;
    int32_t scroll_pos;

    int32_t volume_hold_count;

    service_ptr_t<visualisation_stream_v3> visualisation_stream_ptr;
    static_api_ptr_t<visualisation_manager> visualisation_manager_ptr;
    double spectrum_abs_time;
    audio_chunk_impl spectrum_chunk;
    double spectrum_visual_data[FFT_SIZE / 2];
    char spectrum_char_old[21];
    char spectrum_char[21];
    uint16_t spectrum_get_delay;
    uint16_t spectrum_draw_delay;

    thread_data = (DisplayThreadData*)lpParamter;
    play_info = &thread_data->play_info;
    hid = display_init(thread_data->vid, thread_data->pid);
    if (hid != NULL)
    {
        thread_data->status = 1;
    }
    else
    {
        thread_data->status = -1;
        return -1;
    }
    display_load_default_setting(hid);
    display_set_cp_utf8(hid);

    memset(line1_str, '\0', sizeof(line1_str));
    memset(line2_str, '\0', sizeof(line2_str));
    update_line1 = false;
    update_line2 = false;

    code_exec_time = 0;

    scroll_delay_count = 0;
    scroll_pos = SCROLL_LINE1_SIZE - 1;

    play_info->update_play_state = true; /* 强制更新一次显示 */
    play_info->play_state = PLAY_STATE_STOP;

    memset(scroll_str, '\0', sizeof(scroll_str));

    volume_hold_count = 0;

    memset(spectrum_char, 0x9F, sizeof(spectrum_char));
    memset(spectrum_char_old, 0x9F, sizeof(spectrum_char_old));
    spectrum_char[sizeof(spectrum_char) - 1] = 0x00;
    spectrum_char_old[sizeof(spectrum_char_old) - 1] = 0x00;
    spectrum_get_delay = 0;
    spectrum_draw_delay = 0;
    visualisation_manager_ptr->create_stream(visualisation_stream_ptr, visualisation_manager::KStreamFlagNewFFT);

    while (thread_data->stop == 0)
    {
        start_clock = clock();

        if (play_info->update_play_state == true) /* 电源控制 */
        {
            switch (play_info->play_state)
            {
            case PLAY_STATE_STOP:
                if (cfg_onstop_power <= 3)
                {
                    display_set_power(hid, 1);
                    display_set_dim(hid, cfg_onstop_power);
                }
                else if (cfg_onstop_power == 4)
                {
                    display_set_power(hid, 1);
                    display_clear_screen(hid);
                }
                else if (cfg_onstop_power == 5)
                {
                    display_set_power(hid, 0);
                }
                break;
            case PLAY_STATE_PLAY:
                if (cfg_onplay_power <= 3)
                {
                    display_set_power(hid, 1);
                    display_set_dim(hid, cfg_onplay_power);
                }
                else if (cfg_onplay_power == 4)
                {
                    display_set_power(hid, 1);
                    display_clear_screen(hid);
                }
                else if (cfg_onplay_power == 5)
                {
                    display_set_power(hid, 0);
                }
                break;
            case PLAY_STATE_PAUSE:
                if (cfg_onpause_power <= 3)
                {
                    display_set_power(hid, 1);
                    display_set_dim(hid, cfg_onpause_power);
                }
                else if (cfg_onpause_power == 4)
                {
                    display_set_power(hid, 1);
                    display_clear_screen(hid);
                }
                else if (cfg_onpause_power == 5)
                {
                    display_set_power(hid, 0);
                }
                break;
            }
            /* 不清除 update_play_state，后面还有用到 */
        }

        if (play_info->is_new_track == true) /* 播放新轨道时，初始化第一行滚动变量 */
        {
            if (cfg_fadein_speed != 0)
            {
                scroll_pos = SCROLL_LINE1_SIZE - 1;
            }
            else
            {
                scroll_pos = 0;
            }
            scroll_delay_count = cfg_fadein_speed;
            play_info->is_new_track = false;
        }

        if (scroll_delay_count - code_exec_time > 0) /* 第一行滚动间隔 */
        {
            scroll_delay_count -= code_exec_time;
        }
        else if (play_info->str_line1_avaliable == true && (play_info->play_state == PLAY_STATE_PLAY || play_info->play_state == PLAY_STATE_PAUSE)) /* 第一行滚动控制 */
        {
            if (scroll_pos > 0)
            {
                scroll_delay_count = cfg_fadein_speed;
            }
            else if (scroll_pos == 0)
            {
                scroll_delay_count = cfg_scroll_wait;
            }
            else /* scroll_pos < 0 */
            {
                if (display_get_utf8_len(play_info->str_line_1, 0) > SCROLL_LINE1_SIZE)
                {
                    if (cfg_scroll_speed == 0 && (-scroll_pos % (display_get_utf8_len(play_info->str_line_1, 1) + 1)) == 0)
                    {
                        scroll_delay_count = -1;
                        continue;
                    }
                    else if (cfg_scroll_speed != 0)
                    {
                        scroll_delay_count = cfg_scroll_speed;
                    }
                    else
                    {
                        scroll_delay_count = SCROLL_DEFAULT_SPEED;
                    }
                }
                else
                {
                    scroll_delay_count = -1;
                    continue;
                }
            }
            display_scroll_utf8(play_info->str_line_1, scroll_pos, sizeof(scroll_str) / 3, scroll_str, sizeof(scroll_str));
            strncpy_s(line1_str, scroll_str, sizeof(line1_str));
            update_line1 = true;
            scroll_pos -= 1;
        }

        if (play_info->update_str_line2 == true) /* 第二行字符显示 */
        {
            strncpy_s(line2_str, play_info->str_line_2, sizeof(line2_str));
            update_line2 = true;
            play_info->update_str_line2 = false;
        }

        if (play_info->update_volume == true) /* 第二行音量显示 */
        {
            if (cfg_onvolume_hold > 0)
            {
                volume_hold_count = cfg_onvolume_hold;
                for (i = 0; i < strlen(cfg_onvolume_string2); i++)
                {
                    if (i < sizeof(line2_str) - 1)
                    {
                        line2_str[i] = cfg_onvolume_string2[i];
                    }
                    else
                    {
                        break;
                    }
                }
                if (play_info->volume <= -100.0)
                {
                    play_info->volume = -99.99;
                }
                snprintf(&line2_str[i], sizeof(line2_str) - i, "%+06.2fdB", (double)play_info->volume);
                update_line2 = true;
            }
            play_info->update_volume = false;
        }
        else /* 第二行音量显示保持 */
        {
            if (volume_hold_count - code_exec_time > 0)
            {
                volume_hold_count -= code_exec_time;
                update_line2 = false;
            }
            else if (volume_hold_count >= 0)
            {
                volume_hold_count = -1;
                play_info->update_play_state = true;
                play_info->update_str_line2 = true;
            }
        }

        if (play_info->update_play_state == true) /* 更新第1、2行状态显示 */
        {
            switch (play_info->play_state)
            {
            case PLAY_STATE_STOP:
                if (cfg_onstop_power == 4)
                {
                    update_line1 = false;
                    update_line2 = false;
                    break;
                }
                display_set_cp_user(hid);
                display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_STOP);
                display_set_cp_utf8(hid);
                if (*cfg_onstop_string1 != '\0')
                {
                    strncpy_s(line1_str, cfg_onstop_string1, sizeof(line1_str));
                    update_line1 = true;
                }
                if (*cfg_onstop_string2 != '\0' && volume_hold_count <= 0)
                {
                    strncpy_s(line2_str, cfg_onstop_string2, sizeof(line2_str));
                    update_line2 = true;
                }
                memset(scroll_str, '\0', sizeof(scroll_str));
                break;
            case PLAY_STATE_PLAY:
                if (cfg_onplay_power == 4)
                {
                    update_line1 = false;
                    update_line2 = false;
                    break;
                }
                display_set_cp_user(hid);
                display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_PLAY);
                display_set_cp_utf8(hid);
                break;
            case PLAY_STATE_PAUSE:
                if (cfg_onpause_power == 4)
                {
                    display_set_power(hid, 1);
                    display_clear_screen(hid);
                    update_line1 = false;
                    update_line2 = false;
                    break;
                }
                display_set_cp_user(hid);
                display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_PAUSE);
                display_set_cp_utf8(hid);
                break;
            case PLAY_STATE_LOADING:
                if (cfg_onpause_power != 4)
                {
                    display_set_cp_user(hid);
                    display_draw_ascii(hid, STATEICON_X, STATEICON_Y, 0, STATEICON_FILL, ' ', STATEICON_LOAD);
                    display_set_cp_utf8(hid);
                    if (*cfg_onload_string1 != '\0')
                    {
                        strncpy_s(line1_str, cfg_onload_string1, sizeof(line1_str));
                        update_line1 = true;
                    }
                    if (*cfg_onload_string2 != '\0' && volume_hold_count <= 0)
                    {
                        strncpy_s(line2_str, cfg_onload_string2, sizeof(line2_str));
                        update_line2 = true;
                    }
                }
                break;
            }
            play_info->update_play_state = false;
        }

